Revit 2027 API
ApplicationEntryPoint.CreateRibbonPanel(Tab, String) Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
Public Overrides Function CreateRibbonPanel (
	tab As Tab,
	panelName As String
) As RibbonPanel
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
) override
abstract CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
Parameters
tab Tab
panelName String
Return Value
RibbonPanel
See Also
Reference
ApplicationEntryPoint Class
CreateRibbonPanel Overload
Autodesk.Revit.UI.Macros Namespace